In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('../data/train.csv')

In [20]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [24]:
print("Quantidade de linhas e colunas: ")
df.shape

Quantidade de linhas e colunas:

(891, 12)

## Verifique se há valores nulos no DataFrame.

In [9]:
# Soma de todos os valores nulos de cada coluna
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## Substitua os valores nulos na coluna Age pela média da idade.<br>
Para que os valores nulos possam ser substituidos, é preciso usar o método fillna(), que basicamente substitui os valores nulos por um valor em específico

In [7]:
# O 'inplace = True' faz com que a operação seja feita diretamente no df
df['Age'].fillna(df['Age'].mean(), inplace = True)

In [8]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## Calcule a média, mediana e desvio padrão da coluna Age.

In [12]:
media = df['Age'].mean()
mediana = df['Age'].median()
desvio_padrao = df['Age'].std()

print(f"Média da coluna 'Age': {round(media, 4)}\n")
print(f"Mediana da coluna 'Age': {round(mediana, 4)}\n")
print(f"Desvio padrão da coluna 'Age': {round(desvio_padrao, 4)}\n")

Média da coluna 'Age': 29.6991

Mediana da coluna 'Age': 29.6991

Desvio padrão da coluna 'Age': 13.002

## Obtenha a contagem de valores únicos na coluna Pclass.

In [15]:
print(f"Valores únicos da coluna 'Pclass': {df['Pclass'].nunique()}")

Valores únicos da coluna 'Pclass': 3

## Crie um subconjunto do DataFrame contendo apenas as colunas Name, Sex e Age.

In [23]:
subset = df[['Name', 'Sex', 'Age']]
subset.head()

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                           Allen, Mr. William Henry    male  35.0

## Selecione apenas os passageiros do sexo feminino (coluna Sex = "female").

In [27]:
passageiras = df.loc[df['Sex'] == 'female']
passageiras.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

## Agrupe os dados pela coluna Pclass e calcule a média da idade (Age) para cada classe.

In [31]:
media_idade = round(df.groupby('Pclass')['Age'].mean(), 1)
media_idade

Pclass
1    37.0
2    29.9
3    26.4
Name: Age, dtype: float64

## Agrupe os dados pela coluna Sex e calcule a soma da coluna Survived para cada gênero.

In [32]:
sobriveventes_por_sexo = df.groupby('Sex')['Survived'].sum()
sobriveventes_por_sexo

Sex
female    233
male      109
Name: Survived, dtype: int64

## Adicione uma nova coluna chamada FamilySize que seja a soma das colunas SibSp e Parch.

## Remova a coluna Cabin do DataFrame.

## Ordene o DataFrame pela coluna Fare de forma descendente.

## Filtre os passageiros que têm idade maior que 30 anos e tarifa (Fare) maior que 50.

## Crie um novo DataFrame apenas com os passageiros que sobreviveram (Survived = 1).

## Crie um gráfico de barras que mostre a contagem de passageiros em cada classe (Pclass).

## Crie um histograma da distribuição das idades dos passageiros.